In [2]:
import pandas as pd

In [2]:
# list = array      [1, 2, 3, 4]
# dict = object     {key: [value, value], key1: value, key2: [value]}

In [4]:
pd.DataFrame({
                'A': [1, 2, 3],
                'B': [4, 5, 4]
             
             })

   A  B
0  1  4
1  2  5
2  3  4

In [3]:
var = pd.DataFrame = {
  "calories": [420, 380, 390],
  "duration": [50, 40, 45]
}

var
print(var)

In [11]:
var

{'calories': [420, 380, 390], 'duration': [50, 40, 45]}

In [3]:
pd.DataFrame({
  "calories": [420, 380, 390],
  "duration": [50, 40, 45]
})

   calories  duration
0       420        50
1       380        40
2       390        45

In [6]:
x = [[1,2,3], [3,7,9]]

### TB: if you get this error then restart the kernal

```
TypeError: 'dict' object is not callable

```

![image](https://datalab.noirlab.edu/docs/manual/_images/restartkernelmenu.png)

In [1]:
import pandas as pd

# create a dictionary of data
data = {'Name': ['John', 'Jane', 'Sam'],
        'Age': [25, 30, 35],
        'City': ['New York', 'Los Angeles', 'Chicago']}

# create a dataframe from the dictionary
df = pd.DataFrame(data)

# write the dataframe to a CSV file
df.to_csv('data.csv', index=False)

df

   Name  Age         City
0  John   25     New York
1  Jane   30  Los Angeles
2   Sam   35      Chicago